app/controllers/diaries_controller.rb

  def index
    @diaries = current_user.diaries.all
    @activeentries = (current_user.diaries.where(active: true)).paginate(page: params[:page], :per_page => 5)
---
SELECT "diaries".* FROM "diaries" WHERE "diaries"."user_id" = ?  [["user_id", 1]]
SELECT  "diaries".* FROM "diaries" WHERE "diaries"."user_id" = ? AND "diaries"."active" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["active", 1], ["LIMIT", 5], ["OFFSET", 0]]

  def create
    @diary = Diary.new(diary_params)

    respond_to do |format|
      if @diary.save
---
INSERT INTO "diaries" ("name", "start_time", "end_time", "description", "active", "user_id", "created_at", "updated_at", "comments") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @diary.update(diary_params)
---
UPDATE "diaries" SET "active" = ?, "updated_at" = ? WHERE "diaries"."id" = ?  [["active", 1], ["updated_at", "2018-10-13 19:59:10.493434"], ["id", 2]]

    def set_diary
      @diary = Diary.find(params[:id])
---
SELECT  "diaries".* FROM "diaries" WHERE "diaries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]