app/controllers/meetings_controller.rb

  def index
    @meetings = Meeting.all
    @activemeetings = (Meeting.where(active: true)).paginate(page: params[:page], :per_page => 5)
---
SELECT "meetings".* FROM "meetings"
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."active" = ? LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "meetings" WHERE "meetings"."active" = ?  [["active", 1]]

  def create
    @meeting = Meeting.new(meeting_params)

    respond_to do |format|
      if @meeting.save
---
INSERT INTO "meetings" ("name", "start_time", "end_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "ghdydh"], ["start_time", "2018-10-10 22:47:00"], ["end_time", "2018-10-10 22:47:00"], ["created_at", "2018-10-10 22:47:45.063672"], ["updated_at", "2018-10-10 22:47:45.063672"]]

  def update
    respond_to do |format|
      if @meeting.update(meeting_params)
---
UPDATE "meetings" SET "end_time" = ?, "updated_at" = ? WHERE "meetings"."id" = ?  [["end_time", "2018-10-15 08:48:00"], ["updated_at", "2018-10-13 09:29:36.788776"], ["id", 3]]