app/controllers/rules_controller.rb

SELECT "rules".* FROM "rules"
---
  def index
    @rules = Rule.all

SELECT  "rules".* FROM "rules" WHERE "rules"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @code = Rule.find(params[:id]).code

INSERT INTO "rules" ("reference", "paragrah", "effective_date", "active", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @rule = Rule.new(rule_params)

    respond_to do |format|
      if @rule.save

SELECT  "rules".* FROM "rules" WHERE "rules"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_rule
      @rule = Rule.find(params[:id])