app/controllers/service_providers_controller.rb

  def index
    @service_providers = ServiceProvider.paginate(page: params[:page], :per_page => 5)
---
SELECT  "service_providers".* FROM "service_providers" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "service_providers"

  def create
    @service_provider = ServiceProvider.new(service_provider_params)

    respond_to do |format|
      if @service_provider.save
---
INSERT INTO "service_providers" ("name", "address", "telephone", "email", "acc_number", "active", "user_id", "created_at", "updated_at", "link") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @service_provider.update(service_provider_params)
---
UPDATE "service_providers" SET "address" = ?, "updated_at" = ? WHERE "service_providers"."id" = ?  [["address", "Suite 1, Beaver House, Beech Hill Office Campus Clonskeagh, Dublin, D04 Y8X5"], ["updated_at", "2018-10-07 20:49:32.169463"], ["id", 4]]

  def destroy
    @service_provider.destroy
---
DELETE FROM "service_providers" WHERE "service_providers"."id" = ?  [["id", 3]]

    def set_service_provider
      @service_provider = ServiceProvider.find(params[:id])
---
SELECT  "service_providers".* FROM "service_providers" WHERE "service_providers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]